   /**	ENTERPRISE NATIONALS 1985 **/
   /*	PRINT YACHT INFORMATION - LIST OF ENTRIES - FULL LIST OR SUBSET  */
   /*	BY CATEGORY .							 */
   /*	PRINT IN SAIL NO. SEQUENCE  OR	TALLY SEQUENCE			 */

BOATPRT:  PROC OPTIONS(MAIN);

  DCL COPY_RIGHT  CHAR(20) STATIC INIT('(C) P.NORRIE - 1985');
  %INCLUDE 'DCLINFO.PLI';    /* STRUCTURE FOR YACHT INFO. FILE */
  %INCLUDE 'CTLCHARS.PLI';   /* DCLS FOR PRINTER CONTROL */
  %INCLUDE 'DCLHEAD.PLI';    /* HEADINGS ETC.            */

  DCL HEAD3 CHAR(15) STATIC INIT('LIST OF ENTRIES');
  DCL HEAD3A CHAR(31) STATIC INIT('LIST OF ENTRIES IN TALLY ORDER');
  DCL HEAD4 CHAR(76) STATIC INIT
 ('SAIL NO.   YACHT                SKIPPER              CREW                   ');
  DCL HEAD4A CHAR(56) STATIC INIT
    ('CLUB                   COLOUR       ENTRY    TALLY/BERTH');
  DCL HEAD9 CHAR(40) STATIC INIT('LIST OF YACHTS ENTERED FOR           ');
  DCL HEAD9A CHAR(32) STATIC
	     INIT('LIST OF                  ENTRIES');

  DCL YACHTS FILE;
  DCL OUT    FILE;
  DCL SYSPRINT FILE;
  DCL BOATS DEC FIXED(3) STATIC INIT(0);
  DCL LINE  DEC FIXED(3) STATIC INIT(0);
  DCL CTRY  CHAR(10) STATIC INIT(' ');
  DCL OLDCTRY  CHAR(10) STATIC INIT(' ');
  DCL PRT_TYPE CHAR(5) STATIC;
  DCL FLAGWRK  CHAR(2) STATIC;
  DCL I  BIN FIXED(15) STATIC;

INIT:
  ON ERROR PUT SKIP LIST('ONCODE',ONCODE());
  ON ENDFILE(YACHTS) GO TO EOJ;
  PUT SKIP LIST('PRINT ENTRY LIST');
  PUT SKIP LIST('DO YOU WANT SAIL NO. OR TALLY SEQUENCE ? - SAIL/TALLY - ');
  GET LIST(PRT_TYPE);
  IF PRT_TYPE = 'TALLY'
    THEN OPEN FILE(YACHTS) SEQUENTIAL RECORD KEYED INPUT ENV(F(128),BUFF(4096))
	   TITLE('YACHTS.SRT');
  ELSE OPEN FILE(YACHTS) SEQUENTIAL RECORD KEYED INPUT ENV(F(128),BUFF(4096))
	   TITLE('YACHTS.INFO');
  OPEN FILE(OUT) PRINT TITLE('$LST') LINESIZE(132) PAGESIZE(0);
/*   PUT SKIP LIST('LIST ALL YACHTS, TEAM YACHTS OR PRODUCTION YACHTS?'); */
/*   PUT SKIP LIST('ENTER  ALL/TEAM/PROD - ');  */
/*   GET LIST(PRT_TYPE);			*/

LISTA:	/*  LIST IN SAIL NO. SEQUENCE  */
  CALL HEADS;	/* PRINT HEADINGS */

LA1:
  READ FILE(YACHTS) INTO(BOAT_INFO);
  IF CODE = 'ZZ'
    THEN GO TO LA1;    /* DELETED RECORD - IGNORE */
 /**  IF PRT_TYPE = 'TEAM'                   **/
 /**	THEN IF FLAG2 ~= 'Y'  THEN GO TO LA1;**/   /* NOT TEAM YACHT - IGNORE */
 /**  IF PRT_TYPE = 'PROD'                   **/
 /**   THEN IF FLAG1 ~= 'Y'  THEN GO TO LA1; **/  /* NOT PRODUCTION YACHT  IGNORE */
  BOATS = BOATS + 1;
  LINE = LINE + 1;
  FLAGWRK = FLAG1!!FLAG2;
  PUT FILE(OUT) EDIT(SAIL,NAME,SKIPPER,CREW,CLUB,COLOUR,FLAGWRK,TALLY)
   (SKIP,X(1),A,X(3),A,X(3),A,X(1),A,X(3),A,X(3),A,X(5),A,X(10),A);

  IF LINE < 60	THEN GO TO LA1;  /* PRINT NEXT RECORD */
  CALL CREDIT;	 /* ENDPAGE CREDITS */
  CALL HEADS;	 /* HEADINGS */
  GO TO LA1;  /* PRINT NEXT RECORD */


EOJ:  /* TIDY UP - END OF PROGRAM */
  CALL CREDIT;
  PUT SKIP LIST('NO. OF YACHTS = ',BOATS);
  PUT FILE(OUT) SKIP;	 /* BLANK LINE TO FLUSH BUFFER */
  CLOSE FILE(YACHTS);

/**  PROC TO PRINT ENDPAGE CREDITS  **/
CREDIT:  PROC;
  PUT FILE(OUT) EDIT(TRAIL4) (SKIP(3),A,SKIP(2));
  RETURN;
  END;	/* END CREDITS */

/**  PROC TO PRINT HEADINGS  **/
HEADS:	PROC;
  PUT FILE(OUT) LIST(CTL5,CTL1);  /* WIDE, DOUBLE-STRIKE */
  PUT FILE(OUT) PAGE;
  PUT FILE(OUT) EDIT(HEAD1) (SKIP,X(16),A);
  PUT FILE(OUT) EDIT(HEAD2) (SKIP(2),A);
  /**  IF PRT_TYPE = 'TEAM' **/
  /**	 THEN PUT FILE(OUT) EDIT(HEAD9) (SKIP(2),X(11),A); **/
  /**  ELSE IF PRT_TYPE = 'PROD'                           **/
  /**	   THEN PUT FILE(OUT) EDIT(HEAD9A) (SKIP(2),X(13),A); **/
  /**	  ELSE PUT FILE(OUT) EDIT(HEAD3) (SKIP(2),X(21),A);   **/
  IF PRT_TYPE = 'TALLY'
    THEN PUT FILE(OUT) EDIT(HEAD3A) (SKIP(2),X(18),A);
  ELSE PUT FILE(OUT) EDIT(HEAD3) (SKIP(2),X(25),A);
  PUT FILE(OUT) LIST(CTL1A);	   /* CANCEL WIDE CHARS */
  PUT FILE(OUT) EDIT(HEAD4,HEAD4A) (SKIP(2),A,A);
  PUT SKIP FILE(OUT) LIST(CTL5A);  /* CANCEL DOUBLE-STRIKE */
  LINE = 12;
  RETURN;
  END;	/** END PROC HEADS **/

END;  /** END OF PROGRAM **/


