/**  COPY INFO FILE TO NEW FORMAT **/
COPYINF:  PROC OPTIONS(MAIN);
  %INCLUDE 'DCLINFO.PLI';
  %INCLUDE 'OLDINFO.PLI';
  DCL  IN FILE;
  DCL  OUT FILE;
  DCL  REC   DEC FIXED(3) STATIC INIT(0);

  ON ENDFILE(IN) GO TO EOJ;
  OPEN FILE(IN) SEQUENTIAL RECORD INPUT KEYED ENV(F(128),BUFF(4098))
     TITLE('YACHTS.INF');
  OPEN FILE(OUT) SEQUENTIAL RECORD OUTPUT KEYED ENV(F(128),BUFF(4098))
     TITLE('YACHTS.NEW');
  BOAT_INFO.FILL = ' ';
A:
  READ FILE(IN) INTO(OLD);
  REC = REC + 1;
  BOAT_INFO.CODE    = OLD.CODE;
  BOAT_INFO.SAIL    = OLD.SAIL;
  BOAT_INFO.NAME    = OLD.NAME;
  BOAT_INFO.SKIPPER = OLD.SKIPPER;
  BOAT_INFO.CREW    = OLD.CREW;
  BOAT_INFO.CLUB    = OLD.CLUB;
  BOAT_INFO.COLOUR  = OLD.COLOUR;
  BOAT_INFO.FLAG1   = OLD.FLAG1;
  BOAT_INFO.FLAG2   = OLD.FLAG2;
  BOAT_INFO.RECNO   = OLD.RECNO;
  BOAT_INFO.TALLY   = OLD.TALLY;
  WRITE FILE(OUT) FROM(BOAT_INFO);
  GO TO A;

EOJ:
  PUT SKIP LIST('COPY COMPLETE - RECORDS COPIED = ',REC);
  CLOSE FILE(IN);
  CLOSE FILE(OUT);
  PUT SKIP;
  END;
