 /***  ENTREPRISE NATIONALS  -	1985  ***/
 /*  PROGRAM TO UPDATE SPECIAL CATEGORY FLAGS AFTER MAIN RACE FILES BUILT  */
 /*	     - UPDATES ALL RACE FILES AND OVERALL RESULTS FILE. 	     */
 /*	     YACHT INFO FILE CAN BE UPDATED USING PROGRAM BOATUPD AS USUAL */
FLAGUPD:  PROC OPTIONS(MAIN);

 DCL COPY_RIGHT CHAR(20) STATIC INIT('(C) P.NORRIE 1984');
 %INCLUDE 'DCLRACE.PLI';
 %INCLUDE 'DCLRESLT.PLI';

 DCL  (RACE1,RACE2,RACE3,RACE4,RACE5,RACE6)  FILE;
 DCL  RESULT  FILE;

 DCL  IN1  CHAR(1) STATIC;
 DCL  IN2  CHAR(2) STATIC;
 DCL  IN3  CHAR(3) STATIC;
 DCL  IN6  CHAR(6) STATIC;

 DCL  KEYFLD BIN FIXED(15) STATIC INIT(0);
 DCL  RACENO BIN FIXED(15) STATIC;
 DCL  I      BIN FIXED(15) STATIC;
 DCL  INDEC  DEC FIXED(3)  STATIC;

 DCL  FOUND  BIT(1) STATIC INIT('0'B);
 DCL  FLAG   CHAR(1) STATIC INIT(' ');
 DCL  CTRY   CHAR(3) STATIC;
 DCL  SAIL   CHAR(5) STATIC;

INIT:
  ON ERROR PUT SKIP LIST('ONCODE=',ONCODE());
  ON ENDFILE(RESULT) BEGIN;
    FOUND = '0'B;   /* NO MATCHING YACHT FOUND */
    GO TO MAIN2;    /* OUTPUT MSG AND CONTINUE */
  END;
  OPEN FILE(RESULT) RECORD KEYED DIRECT UPDATE ENV(F(128),BUFF(1024))
       TITLE('OVERALL.DATA');
  OPEN FILE(RACE1) RECORD KEYED DIRECT UPDATE ENV(F(128))
       TITLE('RACE1.DATA');
  OPEN FILE(RACE2) RECORD KEYED DIRECT UPDATE ENV(F(128))
       TITLE('RACE2.DATA');
  OPEN FILE(RACE3) RECORD KEYED DIRECT UPDATE ENV(F(128))
       TITLE('RACE3.DATA');
  OPEN FILE(RACE4) RECORD KEYED DIRECT UPDATE ENV(F(128))
       TITLE('RACE4.DATA');
  OPEN FILE(RACE5) RECORD KEYED DIRECT UPDATE ENV(F(128))
       TITLE('RACE5.DATA');
  OPEN FILE(RACE6) RECORD KEYED DIRECT UPDATE ENV(F(128))
       TITLE('RACE6.DATA');


MAIN:
  PUT SKIP LIST('FLAG UPDATE PROGRAM');
MAIN1:
  PUT SKIP LIST('ENTER 2 CHAR CTRY CODE OR END - ');
  GET LIST(CTRY);
  IF CTRY = 'END'  THEN GO TO EOJ;
  PUT SKIP LIST('ENTER SAIL NUMBER - ');
  GET LIST(SAIL);
  DO I = 1 TO 4;	     /* RIGHT JUSTIFY SAIL NO. */
    IF SUBSTR(SAIL,5,1) = ' '
      THEN SAIL = ' '!!SAIL;
  END;
  CALL FIND;   /* FIND MATCH ON OVERALL RESULTS FILE */
MAIN2:
  IF ~FOUND  THEN DO;
    PUT SKIP LIST('NOT FOUND ON RESULTS FILE');
    GO TO MAIN1;   /* TRY AGAIN OR NEXT SAIL NO. */
  END;
  CALL UPD;    /* UPDATE RESULTS RECORD AND MATCHING RACE RECORDS   */
  GO TO MAIN1;	/* NEXT YACHT */


 /** CODE TO FIND RECORD ON RESULTS FILE  **/
 /*  LOOP UNTIL FIND MATCHING RECORD OR HIT ENDFILE (EXIT TO MAIN2) */
FIND:  PROC;
FIND1:
  READ FILE(RESULT) INTO(OVERALL_RESULTS) KEY(KEYFLD);
  IF CTRY = R_CTRY
    THEN IF SAIL = R_SAIL  THEN DO;
	   FOUND = '1'B;
	   GO TO FINDEND;
	 END;
  KEYFLD = KEYFLD + 1;
  GO TO FIND1;	 /* READ NEXT RECORD */
FINDEND:
  RETURN;
  END;	  /* END PROC FINDEND */


/**  PROC TO UPDATE RESULTS RECORD AND MATCHING RACE RECORDS **/
UPD:  PROC;
  PUT SKIP LIST('FLAGS TO BE UPDATED? - Y/N - ');
  GET LIST(IN1);
  IF IN1 ~= 'Y'  THEN GO TO UPDEND;
  PUT SKIP LIST('ENTER AGE CATEGORY - A = UNDER 18, B = UNDER 21, C = OVER 40  OR BLANK - ');
  GET LIST(FLAG);
  R_FLAG1 = FLAG;
  PUT SKIP LIST('IS THERE A WOMAN IN CREW?  Y/N - ');
  GET LIST(IN2);
  IF IN2 = 'Y'  THEN R_FLAG2 = 'Y';
  ELSE R_FLAG2 = ' ';
  WRITE FILE(RESULT) FROM(OVERALL_RESULTS) KEYFROM(KEYFLD);
  PUT SKIP LIST('OVERALL RESULTS FILE UPDATED');

  READ FILE(RACE1) INTO(RACE_INFO) KEY(R_RECNO);  /* USE RECORD KEY FROM */
		      /* RESULTS RECORD TO PICK UP RECORD FOR SAME YACHT */
  IF CTRY ~= CTRY_CODE ! SAIL ~= SAIL_NO  THEN DO;
    PUT SKIP LIST('LOGIC ERROR - WRONG RECORD FROM RACE FILE');
    GO TO EOJ;
  END;
  RACE_FLAG1 = FLAG;
  RACE_FLAG2 = IN2;
  WRITE FILE (RACE1) FROM(RACE_INFO) KEYFROM(R_RECNO);

  READ FILE(RACE2) INTO(RACE_INFO) KEY(R_RECNO);  /* USE RECORD KEY FROM */
		      /* RESULTS RECORD TO PICK UP RECORD FOR SAME YACHT */
  RACE_FLAG1 = FLAG;
  RACE_FLAG2 = IN2;
  WRITE FILE (RACE2) FROM(RACE_INFO) KEYFROM(R_RECNO);

  READ FILE(RACE3) INTO(RACE_INFO) KEY(R_RECNO);  /* USE RECORD KEY FROM */
		      /* RESULTS RECORD TO PICK UP RECORD FOR SAME YACHT */
  RACE_FLAG1 = FLAG;
  RACE_FLAG2 = IN2;
  WRITE FILE (RACE3) FROM(RACE_INFO) KEYFROM(R_RECNO);

  READ FILE(RACE4) INTO(RACE_INFO) KEY(R_RECNO);  /* USE RECORD KEY FROM */
		      /* RESULTS RECORD TO PICK UP RECORD FOR SAME YACHT */
  RACE_FLAG1 = FLAG;
  RACE_FLAG2 = IN2;
  WRITE FILE (RACE4) FROM(RACE_INFO) KEYFROM(R_RECNO);

  READ FILE(RACE5) INTO(RACE_INFO) KEY(R_RECNO);  /* USE RECORD KEY FROM */
		      /* RESULTS RECORD TO PICK UP RECORD FOR SAME YACHT */
  RACE_FLAG1 = FLAG;
  RACE_FLAG2 = IN2;
  WRITE FILE (RACE5) FROM(RACE_INFO) KEYFROM(R_RECNO);

  READ FILE(RACE6) INTO(RACE_INFO) KEY(R_RECNO);  /* USE RECORD KEY FROM */
		      /* RESULTS RECORD TO PICK UP RECORD FOR SAME YACHT */
  RACE_FLAG1 = FLAG;
  RACE_FLAG2 = IN2;
  WRITE FILE (RACE6) FROM(RACE_INFO) KEYFROM(R_RECNO);
  PUT SKIP LIST('RACE FILES UPDATED');

UPDEND:
  RETURN;
  END;	 /* END PROC UPD */

EOJ:
  CLOSE FILE(RESULT);
  CLOSE FILE(RACE1);
  CLOSE FILE(RACE2);
  CLOSE FILE(RACE3);
  CLOSE FILE(RACE4);
  CLOSE FILE(RACE5);
  CLOSE FILE(RACE6);
  PUT SKIP LIST('FLAG UPDATE PROGRAM ENDED');
  END;


