/**  ENTERPRISE NATIONALS 1985 **/
/*   TABBLD - BUILDS ONE RECORD TABLE TO HOLD RACE START TIMES	*/
/*     NOTE CHANGE FOR ENTERPRISES - NO. OF ENTRIES VARIES BETWEEN RACES */
TABBLD:  PROC OPTIONS(MAIN);
 %INCLUDE 'DCLTABLE.PLI';
 DCL COPY_RIGHT CHAR(20) STATIC INIT('(C) P.NORRIE  1985');

 DCL NUMS CHAR(6) STATIC INIT('123456');
 DCL I	  BIN FIXED(15) STATIC;
 DCL TABLE FILE;
 DCL KEYFLD BIN FIXED(15) STATIC INIT(0);
 OPEN FILE(TABLE) DIRECT KEYED RECORD OUTPUT ENV(F(128)) TITLE('START.TAB');
 DO I = 1 TO 6;
   RACE_NO(I) = SUBSTR(NUMS,1,1);
   START_DATE(I)  = ' ';
   START_MONTH(I) = ' ';
   START_TIME(I)  = ' ';
   STARTERS(I) = 0;
   RACE_TYPE(I) = ' ';
   ENTRIES(I)  = 0;
 END;
 FILL = ' ';
 WRITE FILE(TABLE) FROM(RACE_TABLE) KEYFROM(KEYFLD);
 CLOSE FILE(TABLE);
 PUT SKIP LIST('START TABLE INITIALISED');
 END;



