 /***	ENTERPRISE NATIONAL CHAMPIONSHIPS  ***/
 /*  TOTCALC - TOTAL RESULTS FOR RACES TO DATE. 			   */
 /*	     - HANDLE DISCARDS						   */
 /*	     - (SUB-TOTALLING OF RACES IF REQD. FOR SPECIAL TROPHIES - NOT */
 /*	       RELEVANT TO ENTERPRISE EVENT )				 */

TOTCALC:  PROC OPTIONS(MAIN);

  %INCLUDE 'DCLRESLT.PLI';

  DCL COPY_RIGHT  CHAR(20) STATIC INIT('(C) P.NORRIE - 1985');

  DCL INDEC  DEC FIXED(3) STATIC;
  DCL RECCNT DEC FIXED(3) STATIC INIT(0);
  DCL KEYFLD DEC FIXED(3) STATIC INIT(0);
  DCL MAXREC DEC FIXED(3) STATIC INIT(150);
  DCL (I,J)  BIN FIXED(15) STATIC;
  DCL RACE_PTS	DEC FIXED(6,3) STATIC;
  DCL WORK_PTS (6) DEC FIXED(6,3) STATIC;
  DCL SAVE_PTS DEC FIXED(6,3) STATIC;
  DCL RACE_POSN DEC FIXED(3) STATIC;
  DCL WORK	DEC FIXED(5,2) STATIC;
  DCL DISCARD CHAR(1) STATIC INIT(' ');
  DCL RESULT FILE;

INIT:
  ON ERROR PUT SKIP LIST('ONCODE=',ONCODE());
  ON ENDFILE(RESULT) GO TO EOJ;
  PUT SKIP LIST('OVERALL TOTALS CALCULATION');
INIT2:
  PUT SKIP LIST('ENTER NO. OF RACES COMPLETED - ');
  GET LIST(INDEC);
  IF INDEC < 1 ! INDEC > 6  THEN DO;
     PUT SKIP LIST('TRY AGAIN');
     GO TO INIT2;
  END;
  OPEN FILE(RESULT) DIRECT RECORD KEYED UPDATE ENV(F(128),BUFF(1024))
       TITLE('OVERALL.DATA');


MAIN:
  READ FILE(RESULT) INTO(OVERALL_RESULTS) KEY(RECCNT);
  RECCNT = RECCNT + 1;
  R_TOTAL = 0;
  DO I = 1 TO 6;
     R_TOTAL = R_TOTAL + R_POINTS(I);
  END;

  IF INDEC < 4	THEN DO;    /* < 4 RACES - BYPASS DISCARD CODE */
     R_DISCARD = 0;
     R_TOTDIS  = R_TOTAL;
     GO TO NEXT;
  END;

  DO I = 1 TO 6;	    /* TABLE OF POINTS FOR RACES */
    WORK_PTS(I) = R_POINTS(I);
  END;

  DO J = 1 TO 5;	    /* SORT IN ASCENDING POINTS ORDER */
     DO I = 1 TO 5;
	IF WORK_PTS(I) > WORK_PTS(I+1)
	  THEN DO;
		 SAVE_PTS = WORK_PTS(I);   /* SWAP ENTRIES */
		 WORK_PTS(I) = WORK_PTS(I+1);
		 WORK_PTS(I+1) = SAVE_PTS;
	       END;
     END;
  END;

  DO I = 1 TO 5;   /* DISCARD HIGHEST POINTS RACE */
     R_TOTDIS = R_TOTDIS + WORK_PTS(I);
  END;

  R_DISCARD = WORK_PTS(6);  /* HIGHEST SCORING RACE */


NEXT:
  WRITE FILE(RESULT) FROM(OVERALL_RESULTS) KEYFROM(RECCNT);

EOJ:
  PUT SKIP LIST('TOTALS CALC. PROGRAM ENDED - YACHTS PROCESSED = ',RECCNT);
END;


