/* TEST OF LABELS */
/*  COPYRIGHT 2002, 2003-2004 HENRIK SORENSEN

    THIS FILE IS PART OF GCC FRONT-END FOR THE PL/I PROGRAMMING LANGUAGE, GCC PL/I.

    GCC PL/I IS FREE SOFTWARE; YOU CAN REDISTRIBUTE IT AND/OR MODIFY IT
    UNDER THE TERMS OF THE GNU GENERAL PUBLIC LICENSE AS PUBLISHED BY THE
    FREE SOFTWARE FOUNDATION; VERSION 2.
*/

ALONGLABLENAME:;

A:B:C:;
A1:A2:;

K:A: DO I=1; END A;

GOTO A;

A:A(1): ;

GOTO A(1);

/* LABLES WITH LOCAL SCOPE */
A1:B:PROC;
  B1:DO I=1;
  END B1;
END B;

A2:PROC;
  DO I=1,2;
    DO J=3,4,5;
      PUT SKIP LIST(I,J);
  END;
  END;
END A2;

DCL:FORMAT:ENTRY:PROC;
END;

A3:PROC;
A4: PROC;
DCL:FORMAT:ENTRY:PROC:ENTRY;
DCL(1):;
END A4;
END A3;
A:(ZDIV):B:(STRG):;

DCL A(-1:4) FIXED BIN(15,0);
DEFAULT RANGE(A:G) FIXED BIN(31,0);
(ZDIV):A=1/0;
A:B:I=0;
A(1):B:LABELS:;
DCL:FORMAT:ENTRY:PROC:ENTRY;
DCL(1):;