test: proc;

%DCL (i,j,a) fixed ;

/* 
  DCL a(0:4) fixed init(0 %DO I=1 to 4; ,i %END; ) ; 
 */

%DO a = 1 to 7;

put skip list(j);
 %note('I',"loop variable is "!!j);
/*%DO j=1 to 3; 
put skip list(i,j);
%END;*/

%END;


end ;