/***   DCLHEAD	 ***/
/*  DCLS FOR HEADINGS AND TRAILERS (CREDITS ETC.) */

  DCL  HEAD1  CHAR(40) STATIC INIT
	('ENTERPRISE  NATIONAL  CHAMPIONSHIP');
  DCL  HEAD2  CHAR(70) STATIC INIT
	('    LARGS SAILING CLUB               11TH TO 16TH AUGUST, 1985');
  DCL  TRAIL1 CHAR(50) STATIC INIT
	('WITH THE HELP OF THE ENTERPRISE ASSOCIATION');
  DCL  TRAIL2 CHAR(20) STATIC INIT
	('SPONSORED BY     ');
  DCL  TRAIL3 CHAR(40) STATIC INIT
	('RESULTS SERVICE BY NORRIE, WEST KILBRIDE');
  DCL  TRAIL4 CHAR(80) STATIC INIT('A = UNDER 18,  B = UNDER 21,  C = OVER 40,  L = LADIES ENTRY     ');
  DCL  TRAIL5 CHAR(30) STATIC INIT('PR = PROTEST OUTSTANDING');

