/* HALF TON CUP - DCL FOR OVERALL RESULTS FILE */
DCL 1 OVERALL_RESULTS  STATIC,
      2 R_CTRY	  CHAR(2),     /* COUNTRY CODE */
      2 R_SAIL	  CHAR(5),     /* SAIL NUMBER  */
      2 R_NAME	  CHAR(15),    /* YACHT NAME   */
      2 R_FLAG1   CHAR(1),     /* SPECIAL CATEGORY FLAG */
      2 R_FLAG2   CHAR(1),     /* FLAG IF WOMAN IN CREW */
      2 R_FINTYPE (6) CHAR(3),	       /* FIN/RTD/DNS/DSF/DSQ	 */
      2 R_POSN (6)    DEC FIXED(3),    /* POSITIONS IN EACH RACE */
      2 R_POINTS (6)  DEC FIXED(6,3),  /* POINTS FOR EACH RACE	 */
      2 R_TOTAL   DEC FIXED(6,3),    /* TOTAL POINTS TO DATE	 */
      2 R_TOTDIS  DEC FIXED(6,3),    /* TOTAL POINTS INCL. DISCARD */
      2 R_DISCARD DEC FIXED(6,3),    /* POINTS FOR DISCARD RACE  */
      2 R_OVERALL DEC FIXED(3),      /* OVERALL POSITION TO DATE */
      2 R_RECNO   DEC FIXED(3),      /* KEY OF RECORD IN SAIL SEQ*/
      2 R_FILL	  CHAR(34);

