/* ENTERPRISE NATIONALS - RACE DATA FILES */
DCL 1 RACE_INFO STATIC,
      2 CTRY_CODE  CHAR(2),	   /* COUNTRY CODE */
      2 SAIL_NO    CHAR(5),	   /* SAIL NUMBER */
      2 BOAT_NAME  CHAR(15),	   /* YACHTS NAME */
      2 RACE_FLAG1 CHAR(1),	   /* SPECIAL CATEGORY FLAG   */
      2 RACE_FLAG2 CHAR(1),	   /* FLAG IF WOMAN IN CREW   */
      2 EQUAL_FLAG CHAR(1),	   /* DENOTES EQUAL POSN. TO OTHER BOATS */
      2 F1	   CHAR(5),	   /* TIME OF FINISH 6 CHARS - UNUSED */
      2 F2	   CHAR(6),	   /* ELAPSED TIME IN HHMMSS - UNUSED	   */
      2 FINISH_TYPE CHAR(3),	   /* FIN/RTD/DSQ/DNS/DNF */
      2 PRE_POSN   DEC FIXED(3),   /* PRELIMINARY POSITION */
      2 PR	   CHAR(1),	   /* PROTEST OUTSTANDING OR UPHELD */
      2 PENALTY    DEC FIXED(2),   /* % PENALTY APPLIED */
      2 FIN_POSN   DEC FIXED(3),   /* FINAL POSITION */
      2 POINTS	   DEC FIXED(6,3), /* POINTS FOR THIS RACE */
      2 RACE_RECNO DEC FIXED(3),   /* RECORD KEY - IF IN SAIL NO SEQ. */
      2 FILL	   CHAR(76);

