 /***  STRUCTURE FOR RACE TABLE - START DATES/TIMES, NO. OF ENTRIES ***/
 DCL 1	RACE_TABLE  STATIC,
	2  RACE_ARR (6) ,		/* ONE ENTRY PER RACE	    */
	   3  RACE_NO	  CHAR(1),	/* RACE NUMBER		    */
	   3  START_TIME  CHAR(6),	/* RACE START TIME - HHMMSS */
	   3  START_DATE  CHAR(2),	/* RACE START DATE - aa     */
	   3  START_MONTH CHAR(3),	/* RACE START MONTH - aaa   */
	   3  STARTERS	  DEC FIXED(3), /* YACHTS RANKING AS STARTERS */
					/* NOT USED BY ENTERPRISES  */
	   3  RACE_TYPE   CHAR(1),	/*   AS REQD.		    */
	   3  ENTRIES  DEC FIXED(3),	/* NO. OF ENTRIES FOR RACE  */
	   /* NORMALLY ONE ENTRY FOR SERIES, BUT ENTERPRISES HAVE TO BE DIFFERENT ! */
	2  FILL     CHAR(36);
